Tutorial 1 - Porous Blockage in OpenFOAM/Case/porousBlockage/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          32;
        startFace       4000;
    }
    outlet
    {
        type            patch;
        nFaces          32;
        startFace       4032;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          64;
        startFace       4064;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          64;
        startFace       4128;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4096;
        startFace       4192;
    }
)

// ************************************************************************* //
